#6-1
# Human = {'first_name': 'Mixail',
#          'last_name':'Botcman',
#          'Age':'20','city':'St.Oskol'
#          }
# print(Human['first_name'],Human['last_name'] + "\n" +
#       Human['Age'] + "\n" + Human['city'])
# 6-2 + 6-10
# Numb = {'Nikita':['99','19','54'],
#         'Nastya':['7','47','458'],
#         'Max':['9','13','48','15'],
#         'Ilya':['4','12','8'],
#         'Artem':['13','1337','1488'],
#         }
# for name,number in Numb.items():
#     print(f"Любимое число {name}")
#     for n in number:
#         print("\t" + n)
#6-4
# Terms = {'If':'выбирает, какое действие следует выполнить',
#          'for': 'Цикл',
#          'Словарь':'Используется для хранения данных',
#          'Ключ':'Ключевое слово для поиска по словарю',
#          'Список':'Содержит информацию',
#          'Массив':'Представляет собой набор данных',
#          'Регистр':'lower,upper,title',
#          'Добавить в конец':'append',
#          'Сортировка массив':'Помогает упорядочить элементы в списках,словарях и т.п',
#          'Кортеж':'Тот же список, только не изменяемый',
#         }
#
# for t, o in Terms.items():
#     print("Ключ:" + t)
#     print("Значение:" + o)
